app/controllers/posts_controller.rb

	def edit
		@post = Post.find_by(params[:id])
---
SELECT  "posts".* FROM "posts" WHERE (6) LIMIT 1

	def update

		@post = Post.find_by(params[:id])
		@post.update(title: params[:title], description: params[:description])
---
SELECT  "posts".* FROM "posts" WHERE (1) LIMIT 1
UPDATE "posts" SET "title" = ?, "description" = ?, "updated_at" = ? WHERE "posts"."id" = ?  [["title", "dmitri"], ["description", "asdfasdfTest"], ["updated_at", "2018-07-17 23:06:37.693827"], ["id", 1]]